20210902220546-react.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-08-10 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>React</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">React</h1>
<div id="outline-container-org46a808e" class="outline-2">
<h2 id="org46a808e"><a href="#org46a808e">概要</a></h2>
<div class="outline-text-2" id="text-org46a808e">
<p>
Reactは、Web開発に使われる<a href="20210509100112-javascript.html#ID-a6980e15-ecee-466e-9ea7-2c0210243c0d">JavaScript</a>ライブラリ。変更があった画面の一部だけを更新することで、リロードが必要のない、高速でリッチなWebサイトを構築できる。関数型プログラミングの考え方を背景に持つ。
</p>
</div>
</div>
<div id="outline-container-orgbaac9e8" class="outline-2">
<h2 id="orgbaac9e8"><a href="#orgbaac9e8">Memo</a></h2>
<div class="outline-text-2" id="text-orgbaac9e8">
</div>
<div id="outline-container-org38fc29c" class="outline-3">
<h3 id="org38fc29c"><a href="#org38fc29c">引数を受け取るコンポーネントの例</a></h3>
<div class="outline-text-3" id="text-org38fc29c">
<ul class="org-ul">
<li>複数の引数の受け取り方</li>
<li>関数型の型指定の方法</li>
</ul>

<p>
あたりが詰まりポイント。
</p>

<div class="org-src-container">
<pre class="src src-typescript">export const Square = ({
  isLive,
  click,
}: {
  isLive: boolean;
  click: () =&gt; void;
}) =&gt; {
  return (
    &lt;&gt;
      {isLive ? (
        &lt;button className="square live" onClick={click}&gt;&lt;/button&gt;
      ) : (
        &lt;button className="square death" onClick={click}&gt;&lt;/button&gt;
      )}
    &lt;/&gt;
  );
};
</pre>
</div>
</div>
</div>
<div id="outline-container-org729aada" class="outline-3">
<h3 id="org729aada"><a href="#org729aada">setStateのインクリメント</a></h3>
<div class="outline-text-3" id="text-org729aada">
<p>
引数で前の状態を取り出せる。これで取らないと値が、おかしくなることがある。
</p>

<div class="org-src-container">
<pre class="src src-typescript">const increment = () =&gt; setWidth((prevWidth) =&gt; prevWidth + 1);
</pre>
</div>
</div>
</div>
<div id="outline-container-orge7010d7" class="outline-3">
<h3 id="orge7010d7"><a href="#orge7010d7">onClickは関数型をとる</a></h3>
<div class="outline-text-3" id="text-orge7010d7">
<p>
プロパティonClickが取るのは関数型である。特に深く考えることなかったので詰まった。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>無名関数が入っている。正常</label><pre class="src src-typescript">&lt;button className="square death" onClick={() =&gt; console.log("テスト")}&gt;&lt;/button&gt;
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>間違った例。このとき、console.log(&ldquo;テスト&rdquo;)は評価されてundefinedが渡され、エラーになる</label><pre class="src src-typescript">&lt;button className="square death" onClick={console.log("テスト")}&gt;&lt;/button&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb35eade" class="outline-3">
<h3 id="orgb35eade"><a href="#orgb35eade">hooksの作り方</a></h3>
<div class="outline-text-3" id="text-orgb35eade">
<p>
hookの指針。汎用化できるようにする。
<a href="https://zenn.dev/apple_yagi/articles/bc52d83ec61aee">REST APIと良い感じに通信するHookを自作する</a>
</p>
</div>
</div>
<div id="outline-container-org24243ee" class="outline-3">
<h3 id="org24243ee"><a href="#org24243ee">サーバーサイドレンダリング</a></h3>
<div class="outline-text-3" id="text-org24243ee">
<p>
読み込み時はコンポーネントをHTMLで静的に描画。あとからコンポーネントDOMに対してイベントをフックすることで操作できるようにする(ハイドレーション)。
これによって、高速表示ができる。
サーバーサイド(Node)と、クライアントサイド(ブラウザ環境)のAPIは一部異なる部分があるので、これを共通化する必要がある。
</p>

<p>
通常の、ブラウザでDOMを描画するほうはクライアントサイドレンダリング。
</p>
</div>
</div>
<div id="outline-container-orgea0ea34" class="outline-3">
<h3 id="orgea0ea34"><a href="#orgea0ea34">便利ツール</a></h3>
<div class="outline-text-3" id="text-orgea0ea34">
<p>
さまざまなReactのためのlintが存在する。
</p>
<ul class="org-ul">
<li>hook</li>
<li>eslint-plugin-jsx-a11y</li>
</ul>

<p>
ESLint はコードの正しさを保つのに対し、Prettier はコードの読みやすさを保つためのツール。
同時に使うことができる。
</p>
<blockquote>
<p>
eslint-config-prettier は、ESLint のルールのうち、Prettier と相容れないものを無効化
する共有設定です。一方の eslint-plugin-prettier は、Prettier のルールを ESLint のルー
ルに統合するためのプラグインです。つまるところ、これらのパッケージにより、ESLint から
Prettier を実行することが可能になります。
</p>
</blockquote>

<p>
prettier でコード形式を統一できる。
</p>

<p>
<a href="20210831232330-typescript.html#ID-ad1527ee-63b3-4a9b-a553-10899f57c234">TypeScript</a>のテンプレートで作成。
</p>
<div class="org-src-container">
<pre class="src src-shell">npx create-react-app my-type --template typescript
</pre>
</div>
</div>
</div>
<div id="outline-container-org6c59ae4" class="outline-3">
<h3 id="org6c59ae4"><a href="#org6c59ae4">fiber</a></h3>
<div class="outline-text-3" id="text-org6c59ae4">
<p>
Reactの非同期でDOMの変更を検知する仕組みのこと。
</p>
</div>
</div>
<div id="outline-container-org8b45f25" class="outline-3">
<h3 id="org8b45f25"><a href="#org8b45f25">ステート</a></h3>
<div class="outline-text-3" id="text-org8b45f25">
<p>
プロパティはいわばRead-Onlyなデータで、一度コンポーネントが描画されると変更されない。
一方、コンポーネントの描画後に変更されるデータをステートという。
</p>

<p>
あるコンポーネントのステートの変更が、他のコンポーネントのプロパティに伝播し、それが全体に波及していく…。
</p>
</div>
</div>
<div id="outline-container-orgb075832" class="outline-3">
<h3 id="orgb075832"><a href="#orgb075832">Webpack</a></h3>
<div class="outline-text-3" id="text-orgb075832">
<p>
ReactだけではWEB機能を提供できない。
ほかの機能もまとめてモジュール間を調整するのが、モジュールバンドラ。
<code>Webpack</code>, <code>Browserify</code>, <code>Gulp</code>, <code>Grunt</code> などが存在する。
一番使われているのがWebpack。
</p>

<p>
<code>import</code> をたどって依存モジュールのグラフを作成する。
</p>

<div class="org-src-container">
<pre class="src src-shell">npm install --save-dev webpack webpack-cli
npm install babel-loader @babel/core --save-dev
npm install @babel/preset-env @babel/preset-react --save-dev
</pre>
</div>

<ul class="org-ul">
<li>webpack.config.js</li>
<li>.babelrc</li>
</ul>

<p>
を設定する。
</p>

<p>
単一のファイルにビルドするとエラーが起きたときの行番号がわからなくなる。
<code>ソースマップ</code> を使うとどこで起きたかわかる。.mapと拡張子のついたファイル。
webpackに設定を追加すると、ビルド時生成されるようになる。
</p>

<p>
<code>create-react-app</code> を使うとこれらの作業を自動でやってくれる。
</p>
</div>
</div>
<div id="outline-container-orgdc74b4e" class="outline-3">
<h3 id="orgdc74b4e"><a href="#orgdc74b4e">フラグメント</a></h3>
<div class="outline-text-3" id="text-orgdc74b4e">
<p>
コンポーネントを並列に描画はできない。
1つである必要があるが、いちいち包含コンポーネントを書くのは面倒。
フラグメントを使うと簡潔に1つのコンポーネントにまとめられる。
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span class="org-keyword">function</span> <span class="org-function-name">Cat</span>({ name }) {
    <span class="org-keyword">return</span> (
        &lt;React.Fragment&gt;
            &lt;h1&gt;The cat<span class="org-string">'s name is {name}&lt;/h1&gt;</span>
<span class="org-string">            &lt;p&gt;&lt;He'</span>s good.&lt;/p&gt;
        &lt;React.Fragment&gt;
    )
}

<span class="org-comment-delimiter">// </span><span class="org-comment">&#30465;&#30053;&#35352;&#27861;</span>
<span class="org-keyword">function</span> <span class="org-function-name">Cat</span>({ name }) {
    <span class="org-keyword">return</span> (
        &lt;&gt;
            &lt;h1&gt;The cat<span class="org-string">'s name is {name}&lt;/h1&gt;</span>
<span class="org-string">            &lt;p&gt;&lt;He'</span>s good.&lt;/p&gt;
        &lt;&gt;
    )
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org2d28f13" class="outline-3">
<h3 id="org2d28f13"><a href="#org2d28f13">デストラクチャリングで簡潔に表示する</a></h3>
<div class="outline-text-3" id="text-org2d28f13">
<div class="org-src-container">
<pre class="src src-javascript"><span class="org-comment-delimiter">// </span><span class="org-comment">&#8595;&#20351;&#12431;&#12394;&#12356;&#20363;</span>
<span class="org-keyword">function</span> <span class="org-function-name">Menu</span>(<span class="org-variable-name">props</span>) {
    <span class="org-keyword">return</span> (
        &lt;h1&gt;{props.title}&lt;/h1&gt;
    )
}

<span class="org-comment-delimiter">// </span><span class="org-comment">&#8595;&#12487;&#12473;&#12488;&#12521;&#12463;&#12481;&#12515;&#12522;&#12531;&#12464;&#12434;&#20351;&#12358;&#12392;&#31777;&#28500;&#12395;&#26360;&#12369;&#12427;</span>
<span class="org-keyword">function</span> <span class="org-function-name">Menu</span>({title, recipes}) {
    <span class="org-keyword">return</span> (
        &lt;h1&gt;{title}&lt;/h1&gt;
    )
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc564c8e" class="outline-3">
<h3 id="orgc564c8e"><a href="#orgc564c8e">コンポーネント作成方法の変遷</a></h3>
<div class="outline-text-3" id="text-orgc564c8e">
<ol class="org-ol">
<li>createClass関数(廃止)</li>
<li>クラスコンポーネント(将来廃止)</li>
<li>関数コンポーネント(最新)</li>
</ol>
</div>
</div>
<div id="outline-container-orgf8ad5ba" class="outline-3">
<h3 id="orgf8ad5ba"><a href="#orgf8ad5ba">package.jsonの例</a></h3>
<div class="outline-text-3" id="text-orgf8ad5ba">
<div class="org-src-container">
<pre class="src src-json">"scripts": {
  "start": "react-scripts start",
  "build": "react-scripts build",
  "test": "react-scripts test",
  "eject": "react-scripts eject",
  "start:server": "ts-node -O '{\"module\": \"commonjs\"}' ./server/index.ts",
  "dev": "concurrently --kill-others \"npm run start:server\" \"npm run start\""
},
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbaa9b7d" class="outline-3">
<h3 id="orgbaa9b7d"><a href="#orgbaa9b7d">Provider</a></h3>
<div class="outline-text-3" id="text-orgbaa9b7d">
<p>
props渡し地獄を回避するための組み込みの関数。
</p>

<div class="org-src-container">
<pre class="src src-react">&lt;ExampleContext.Provider value={resource.name}&gt;
  &lt;NavigationComponent /&gt; // ← このコンポーネントではcontextで値を取得できるようになる。
&lt;/ExampleContext.Provider&gt;
</pre>
</div>

<dl class="org-dl">
<dt>参考</dt><dd><a href="https://qiita.com/ryokkkke/items/dc25111fcf52ea579d58">React Contextの使い方 - Qiita</a></dd>
</dl>
</div>
</div>
<div id="outline-container-orga511805" class="outline-3">
<h3 id="orga511805"><a href="#orga511805">プロジェクトを新規作成するコマンド</a></h3>
<div class="outline-text-3" id="text-orga511805">
<p>
React+<a href="20210831232330-typescript.html#ID-ad1527ee-63b3-4a9b-a553-10899f57c234">TypeScript</a>、chapter03というディレクトリ名で作成する場合。
</p>
<div class="org-src-container">
<pre class="src src-shell">npx create-react-app chapter03 --template typescript
npm install -D tslint <span class="org-comment-delimiter"># </span><span class="org-comment">tslint&#23566;&#20837;</span>
npx tslint --init <span class="org-comment-delimiter"># </span><span class="org-comment">tslint&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdf2c24c" class="outline-3">
<h3 id="orgdf2c24c"><a href="#orgdf2c24c">Context</a></h3>
<div class="outline-text-3" id="text-orgdf2c24c">
<p>
contextはコンポーネント間で情報をやりとりしやすくするための関数。
コンポーネント間でグローバルに値を共有できる。
が、好き放題に値を変えられると安全性や可読性が下がるので、アクションを通してしか値を変化させられないようになっている。
</p>
</div>
</div>
<div id="outline-container-org3579eec" class="outline-3">
<h3 id="org3579eec"><a href="#org3579eec">Reducer</a></h3>
<div class="outline-text-3" id="text-org3579eec">
<p>
状態とアクションを元に、行うことを振り分ける関数。
</p>
</div>
</div>
<div id="outline-container-org9b7a6fd" class="outline-3">
<h3 id="org9b7a6fd"><a href="#org9b7a6fd">Hook</a></h3>
<div class="outline-text-3" id="text-org9b7a6fd">
<p>
hookはコンポーネントとは独立した関数で、コンポーネントに対して着脱可能な機能を取り付けるイメージ。ステートを追加したいなら <code>useState</code> 。
</p>

<p>
<code>use</code> はReact hooksにつくプレフィクス。
</p>
<dl class="org-dl">
<dt>参考</dt><dd><a href="https://qiita.com/seira/items/e62890f11e91f6b9653f">React hooksを基礎から理解する (useEffect編) - Qiita</a></dd>
</dl>

<p>
hookという名の通り、実行タイミングに関係している。
たとえば、 <code>useEffect</code> に渡された関数はレンダーの結果が画面に反映された後で動作する。
</p>
</div>
</div>
<div id="outline-container-org8e8b0ca" class="outline-3">
<h3 id="org8e8b0ca"><a href="#org8e8b0ca">{} はオブジェクト</a></h3>
<div class="outline-text-3" id="text-org8e8b0ca">
<p>
jsではオブジェクトを表す表記。
</p>
<div class="org-src-container">
<pre class="src src-typescript">const { state, dispatch } = useAppState()
</pre>
</div>
<p>
は、通常のオブジェクトを作る{}と同じ。
つまり、↓と同じ。
</p>
<div class="org-src-container">
<pre class="src src-typescript">{
  state,
  dispatch
}
</pre>
</div>

<p>
これらに関数の返り値が代入される、とそれだけのこと。
</p>
</div>
</div>
</div>
<div id="outline-container-org60f7734" class="outline-2">
<h2 id="org60f7734"><a href="#org60f7734">Tasks</a></h2>
<div class="outline-text-2" id="text-org60f7734">
</div>
<div id="outline-container-org5baae69" class="outline-3">
<h3 id="org5baae69"><a href="#org5baae69"><span class="todo TODO">TODO</span> <a href="https://speakerdeck.com/recruitengineers/react">React - Speaker Deck</a></a></h3>
<div class="outline-text-3" id="text-org5baae69">
<p>
Reactの解説。
</p>

<ul class="org-ul">
<li>jQueryではDOMをグローバル変数としていじらないといけなかった</li>
<li>viewがテンプレートとjsで分離していて辛かった</li>
<li>Reactは宣言的UI。「何」を記述する</li>
<li>jQueryは命令的UIになりがち。「どうするか」を記述する</li>
<li>Reactは状態が変わるごとにコンポーネントを毎回実行してDOMを新規に構築</li>
<li>毎回新規にレンダリングするのと同等なので、画面の更新について考えることが減る</li>
<li>仮想DOM&#x2026;DOMの代わりにjsのオブジェクト(軽量)で仮想的なDOMを構築する
<ul class="org-ul">
<li>仮想DOMを比較して、差分だけをDOMに反映する</li>
</ul></li>
<li>ReactはUI構築のためのライブラリ。フレームワークではない。Viewに特化している</li>
<li>JSX &#x2026; js XML
<ul class="org-ul">
<li>jsの式としてXML風の構文を記述できる</li>
<li>BabelやTS等のツールによってjsの式に変換される</li>
</ul></li>
<li>JSXとHTMLの違い
<ul class="org-ul">
<li>小文字と大文字を区別する</li>
<li>キャメルケースを使う</li>
<li>HTMLと異なる属性名がある</li>
</ul></li>
<li>コンポーネント
<ul class="org-ul">
<li>コンポーネントは状態を持てる</li>
<li>関数コンポーネントは単なる関数で、関数自体は状態を持っていない</li>
<li>状態はReactが管理する仮想DOM(Fiber構造体)によって管理される</li>
<li>関数コンポーネントからReactが管理する情報とやりとりするためにHooksを使う</li>
</ul></li>
<li>useRef
<ul class="org-ul">
<li>OOPにおけるインスタンス変数の代わりに使用すう</li>
<li>仮想DOMをインスタンスとみなす</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgd52302f" class="outline-3">
<h3 id="orgd52302f"><a href="#orgd52302f"><span class="todo TODO">TODO</span> <a href="https://future-architect.github.io/articles/20200501/">TypeScriptでReactをやるときは、小さいアプリでもReduxを最初から使ってもいいかもねというお話 | フューチャー技術ブログ</a></a></h3>
<div class="outline-text-3" id="text-orgd52302f">
<p>
Redux Toolkitがなぜ使いやすいかの解説。
</p>
</div>
</div>
</div>
<div id="outline-container-orgb1b704c" class="outline-2">
<h2 id="orgb1b704c"><a href="#orgb1b704c">Reference</a></h2>
<div class="outline-text-2" id="text-orgb1b704c">
</div>
<div id="outline-container-orgd97b391" class="outline-3">
<h3 id="orgd97b391"><a href="#orgd97b391"><span class="todo TODO">TODO</span> <a href="https://www.oreilly.co.jp/books/9784873119380/">O&rsquo;Reilly Japan - Reactハンズオンラーニング 第2版</a></a></h3>
<div class="outline-text-3" id="text-orgd97b391">
<p>
Reactの入門書。
</p>
</div>
</div>
</div>
<div id="outline-container-org0622a58" class="outline-2">
<h2 id="org0622a58"><a href="#org0622a58">Archives</a></h2>
</div>


<div id="outline-container-org2f6db3c" class="outline-2">
<h2 id="org2f6db3c"><a href="#org2f6db3c">Backlinks</a></h2>
<div class="outline-text-2" id="text-org2f6db3c">
<ul class="org-ul">
<li><a href="./20210509095946-rails.html">Rails</a></li>
<li><a href="./20210509100112-javascript.html">JavaScript</a></li>
<li><a href="./20210615101425-learning.html">Learning</a></li>
<li><a href="./20210817003906-history.html">History</a></li>
<li><a href="./20211030122204-graphql.html">GraphQL</a></li>
<li><a href="./20220417151711-flutter.html">Flutter</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
